performance-testing.yml
config:
  target: 'https://demo-pruebas-operacionales.herokuapp.com'
  plugins:
    expect: {}
    fuzzer: {}
  phases:
    - duration: 40
      arrivalRate: 9
    
  ensure:
    maxErrorRate: 2
scenarios:
  - name: 'Test the complete flow'
    flow:
      - think: 60
      - get:
          url: '/'
          expect:
            - statusCode: 200

      - get:
          url: '/index'
          expect:
            - statusCode: 200
      
      - post:
          url: "/api"
          json:
            username: "{{ naughtyString }}"
            password: "secret"
      - log: "***** naughtyString = {{ naughtyString }}"